bl_off=(Arr\u00eat)

# Resource keys for foorm
foorm.missing.field=Champ requis \:
foorm.maxlength.field=Champ >
foorm.integer.field=Le champ doit \u00eatre un entier \:
foorm.id.field=Le champ contient des caract\u00e8res non valides \:
foorm.url.field=Le champ n\u2019est pas une url \:

error.missing.toolid=Il manque l\u2019identifiant de l\u2019outil
error.invalid.toolid=Identifiant de l\u2019outil non valide
error.content.not.found=Configuration de l\u2019outil introuvable
error.placement.not.found=\u00c9l\u00e9ment de contenu de l\u2019outil introuvable

id=Cl\u00e9 primaire
tool_id=Outil associ\u00e9
bl_title=Titre d\u2019outil (au-dessus de l\u2019outil)
bl_allowtitle=Autoriser la modification du titre de l\u2019outil
bl_allowtitle_allow=Autoriser
bl_allowtitle_disallow=Interdire
bl_pagetitle=Texte du bouton (texte dans le menu outil)
bl_allowpagetitle = Autoriser la modification du texte du bouton
bl_allowpagetitle_allow=Autoriser
bl_allowpagetitle_disallow=Interdire
bl_content_title=Outil de configuration de titre
bl_description=Description
bl_note=Note
bl_status=\u00c9tat de l\u2019outil
bl_status_enable=Activ\u00e9
bl_status_disable=D\u00e9sactiv\u00e9
bl_visible=Visibilit\u00e9 de l\u2019outil
bl_visible_visible=Visible
bl_visible_stealth=Camoufl\u00e9
bl_launch=URL de lancement
bl_allowlaunch=Autoriser la modification de l\u2019URL de lancement
bl_allowlaunch_allow=Autoriser
bl_allowlaunch_disallow=Interdire
bl_consumerkey=Cl\u00e9 de lancement
bl_allowconsumerkey=Autoriser la modification de la cl\u00e9 de lancement
bl_allowconsumerkey_allow=Autoriser
bl_allowconsumerkey_disallow=Interdire
bl_secret=Secret de lancement
bl_allowsecret=Permettre la modification du secret de lancement
bl_allowsecret_allow=Autoriser
bl_allowsecret_disallow=Interdire
SITE_ID=Identifiant de l\u2019espace (laisser vide pour rendre l\u2019outil disponible dans tous les espaces)
bl_content_site_id=Identifiant de l\u2019espace
bl_frameheight=Hauteur du cadre
bl_allowframeheight=Autoriser la modification de la hauteur du cadre
bl_allowframeheight_allow=Autoriser
bl_allowframeheight_disallow=Interdire
bl_toolorder=Ordre des outils (valable uniquement pour les outils plac\u00e9s dans tous les espaces)
bl_siteinfoconfig=Bo\u00eete de dialogue de configuration lorsque l\u2019outil est s\u00e9lectionn\u00e9
bl_siteinfoconfig_bypass=Outrepasser la fen\u00eatre de configuration
bl_siteinfoconfig_config=Voir la configuration
bl_newpage=Lancer dans une fen\u00eatre popup
bl_newpage_off=Ne jamais lancer dans une fen\u00eatre popup
bl_newpage_on=Toujours lancer dans une fen\u00eatre popup
bl_newpage_content=Autoriser la modification du choix de fen\u00eatre popup
bl_debug=Lancement de d\u00e9bogage
bl_debug_off=Ne jamais lancer en mode d\u00e9bogage
bl_debug_on=Toujours lancer en mode d\u00e9bogage
bl_debug_content=Permettre la modification du choix du mode d\u00e9bogage
privacy=R\u00e9glage des param\u00e8tres de confidentialit\u00e9 \:
bl_sendname=Envoyer les noms des utilisateurs \u00e0 l\u2019outil externe
bl_sendemailaddr=Envoyer les adresses de courriel \u00e0 l\u2019outil externe
services=Services \:
bl_allowoutcomes=Autoriser l\u2019outil externe \u00e0 renvoyer des notes
bl_allowlineitems=Autoriser l\u2019outil externe \u00e0 cr\u00e9er des colonnes de notes
bl_allowroster=Fournir la liste des participants \u00e0 l\u2019outil externe
bl_allowsettings=Autoriser l\u2019outil externe \u00e0 stocker les param\u00e8tres
pl_header=Les outils peuvent g\u00e9n\u00e9ralement accepter les LTI Launches directs ou les Content-Item / Deep-Link Selection launches. Ce n\u2019est pas fr\u00e9quent, mais certains outils peuvent g\u00e9rer les deux types de lancement \u00e0 un point de terminaison.
bl_allowcontentitem=L\u2019URL de l\u2019outil peut recevoir le lancement d\u2019un Content-Item / Deep-Link
bl_pl_launch=L\u2019URL de l\u2019outil peut recevoir un lancement LTI
bl_pl_linkselection=L\u2019outil peut recevoir un lancement d\u2019un Content-Item / Deep-Link
pl_placement=Indiquez o\u00f9 ces outils sont plac\u00e9s dans Sakai. Tous les outils sont disponibles dans les Le\u00e7ons.
bl_pl_contenteditor=Autoriser l\u2019utilisation de l\u2019outil \u00e0 partir de l\u2019\u00e9diteur de texte enrichi
bl_pl_assessmentselection=Autoriser l\u2019outil comme l\u2019un des types d\u2019\u00e9valuation
bl_pl_importitem=Autorise l\u2019outil \u00e0 fournir une cartouche commune (g\u00e9n\u00e9ralement \u00e0 \u00eatre import\u00e9 dans un outil tel que le\u00e7ons)
bl_pl_fileitem=Permettre \u00e0 l\u2019outil de fournir un fichier (g\u00e9n\u00e9ralement dans le cadre d\u2019un s\u00e9lecteur de fichiers)
bl_allowcustom=Autoriser des param\u00e8tres personnalis\u00e9s suppl\u00e9mentaires
bl_custom=Param\u00e8tres personnalis\u00e9s (cl\u00e9 \= valeur sur des lignes s\u00e9par\u00e9es)
bl_rolemap=Mapper manuellement les r\u00f4les Sakai aux r\u00f4les IMS. Exemple\: Enseignat\:Learner;\u00e9tudiant\:Learner
bl_splash=\u00c9cran de d\u00e9marrage (si ce n\u2019est pas vide, l\u2019\u00e9cran sera affich\u00e9 avant que l\u2019outil soit lanc\u00e9)
bl_fa_icon=Choisir une ic\u00f4ne personnalis\u00e9e (laisser vide pour utiliser l\u2019ic\u00f4ne par d\u00e9faut)
bl_allowfa_icon=Autoriser le changement d\u2019ic\u00f4ne personnalis\u00e9e
bl_allowfa_icon_allow=Autoriser
bl_allowfa_icon_disallow=Interdire
bl_matchpattern=Mod\u00e8le auquel l\u2019URL de lancement doit correspondre
bl_launchurl=URL de lancement r\u00e9elle
bl_resource_handler=Gestionnaire de la ressource
bl_parameter=Param\u00e8tres de lancement
bl_enabled_capability=Capacit\u00e9s activ\u00e9es
bl_contentitem=Fonctionnalit\u00e9s activ\u00e9es
bl_sha256=Support des signatures SHA-256
bl_sha256_off=Signer le lancement avec SHA-1 (Legacy)
bl_sha256_on=Signer Lancement avec SHA-256
bl_sha256_content=D\u00e9l\u00e9guer \u00e0 chaque \u00e9l\u00e9ment de contenu
bl_lti13=Si vous s\u00e9lectionnez le support LTI 1.3, vos informations de configuration doivent \u00eatre imm\u00e9diatement consult\u00e9es une fois que l\u2019enregistrement de l\u2019outil a \u00e9t\u00e9 ins\u00e9r\u00e9.  Si votre outil a fourni une cl\u00e9 publique ou un jeu de cl\u00e9s pour LTI 1.3, saisissez-le, sinon laissez les deux champs vides et des cl\u00e9s publiques et priv\u00e9es vous seront fournies.  Si nous g\u00e9n\u00e9rons une cl\u00e9 priv\u00e9e pour l\u2019outil, vous devez la visualiser et la communiquer \u00e0 l\u2019outil imm\u00e9diatement car elle sera supprim\u00e9e peu de temps apr\u00e8s sa cr\u00e9ation.
bl_lti13_inherit=H\u00e9riter les param\u00e8tres LTI 1.3 de l\u2019outil (par d\u00e9faut)
bl_lti13_off=L\u2019outil ne supporte pas LTI 1.3
bl_lti13_on=L\u2019outil prend en charge LTI 1.3
bl_lti13_settings=Param\u00e8tres pour LTI 1.3

bl_lti13_client_id=LTI 1.3 Client ID (fournir \u00e0 l\u2019outil)
bl_lti13_platform_public=LTI 1.3 Platform Public Key (provide to the tool)
bl_lti13_platform_private=Cl\u00e9 priv\u00e9e LTI 1.3 Platform (pour les messages du LMS)

bl_lti13_oidc_endpoint=LTI 1.3 Tool OpenID Connect/Initialization Endpoint (fourni par l\u2019outil)
bl_lti13_oidc_redirect=LTI 1.3 Tool Redirect Endpoint(s) (s\u00e9par\u00e9s par des virgules et fournis par l\u2019outil)

bl_lti13_tool_keyset=URL du jeu de cl\u00e9s LTI 1.3 (fourni par l\u2019outil)

lti13_legacy_key=Ces champs ne sont utilis\u00e9s que si l\u2019outil ne fournit pas de support pour le clavier.  S\u2019il existe une URL de jeu de cl\u00e9s pour cet outil, ces valeurs sont ignor\u00e9es.  Si l\u2019outil ne prend pas en charge une URL de jeu de cl\u00e9s, ces champs seront automatiquement remplis avec une paire de cl\u00e9s publiques/priv\u00e9es g\u00e9n\u00e9r\u00e9es par Sakai ou vous pouvez d\u00e9finir la cl\u00e9 publique explicitement.
bl_lti13_tool_public=LTI 1.3 Tool Public Key (provided by the tool)
bl_lti13_tool_private=LTI 1.3 Tool Private Key (for messages from the tool)

bl_lti13_tool_kid=LTI 1.3 Tool Latest KID value (for messages from the tool)

bl_lti13_platform_header=Ces champs sont \u00e9galement requis pour LTI 1.3, mais ils ne doivent pas \u00eatre partag\u00e9s avec l\u2019outil.

bl_version=Version LTI
bl_version_lti1=Outil LTI 1.x

bl_lti11_launch_type=Type de lancement LTI 1.1 \u00e0 utiliser
bl_lti11_launch_type_inherit=H\u00e9riter la valeur par d\u00e9faut de l\u2019ensemble du syst\u00e8me
bl_lti11_launch_type_legacy=Utiliser le lancement de l\u2019ancienne LTI 1.1
bl_lti11_launch_type_lti112=Utiliser le lancement Round-trip LTI 1.1

error.id.not.found = Impossible de trouver l\u2019identifiant de l\u2019outil LTI.
error.maintain.link = Seul le responsable de l\u2019espace est autoris\u00e9 \u00e0 g\u00e9rer les liens de l\u2019outil LTI
error.link.placement.update = Erreur de mise \u00e0 jour des informations de placement dans l\u2019\u2019\u00e9l\u00e9ment de configuration {0}
error.maintain.edit = Il faut \u00eatre responsable de l\u2019espace pour modifier
error.tool.not.found = Outil introuvable
error.need.key.secret = Cet outil ne fonctionnera pas sans une cl\u00e9 et un secret.
error.placement.not.removed = Impossible de supprimer le placement de l\u2019outil

#export fields
export.title=Titre
export.url=URL
export.sitetitle=Code du cours (p. ex. F13-ACCT-134C-01)
export.siteid=Identifiant de l\u2019espace
export.createdat=Ajout\u00e9 le
export.sitecontactname=Propri\u00e9taire de l\u2019espace
export.sitecontactemail=Propri\u00e9taire
content.attribution=Service/D\u00e9partement
