# this defines the entity description for site
site = Repr\u00e9sente un espace (une collection d\u2019utilisateurs et des outils) dans le syst\u00e8me de Sakai
site.view.new = L\u2019ajout d\u2019un espace d\u00e9finira toujours le propri\u00e9taire/cr\u00e9\u00e9 par l\u2019utilisateur courant \u00e0 moins que \u2019owner\u2019 ne soit d\u00e9fini sur un identifiant d\u2019utilisateur, le minimum pour cr\u00e9er un espace est l\u2019id et le type, tous les autres champs sont facultatifs
site.view.list = R\u00e9cup\u00e8re la liste de tous les espaces auxquels l\u2019utilisateur actuel peut acc\u00e9der. Fournissez une valeur pour \u2019_limit\u2019 pour sp\u00e9cifier combien d\u2019espaces doivent \u00eatre retourn\u00e9s. Notez qu\u2019il y a un maximum syst\u00e8me qui remplacera une valeur sp\u00e9cifi\u00e9e si elle est sup\u00e9rieure \u00e0 autoris\u00e9e. Fournit une valeur pour \u2019_start\u2019 \u00e0 la page \u00e0 travers les r\u00e9sultats dans plusieurs requ\u00eates. Par exemple, avec 42 espaces, les requ\u00eates avec \u2019_start\u2019 \= 1, \u2019_limit\u2019 \= 50 puis \u2019_start\u2019 \= 51, \u2019_limit\u2019 \= 50 pourrait \u00eatre utilis\u00e9 pour r\u00e9cup\u00e9rer le premier lot de 42 espaces et le second \u00e9tant vide signifierait la fin des r\u00e9sultats disponibles.
site.view.edit = Peut mettre \u00e0 jour tous les champs accessibles en \u00e9criture dans l\u2019espace, y compris le propri\u00e9taire
site.view.show = Permet la visualisation des donn\u00e9es d\u2019un seul site, utilisez \u2019includeGroups\u2019 (bool\u00e9en) pour \u00e9galement obtenir les donn\u00e9es des groupes avec l\u2019espace
site.view.show.field.includeGroups = utilisez ce bool\u00e9en pour obtenir les groupes de cet espace
site.redirect./{prefix}/{id}/memberships = Permet la r\u00e9cup\u00e9ration de toutes les adh\u00e9sions pour un espace en redirigeant vers l\u2019entit\u00e9 des adh\u00e9sions fournisseur
site.Updateable = La valeur du propri\u00e9taire (userId) peut maintenant \u00eatre modifi\u00e9e une fois l\u2019espace cr\u00e9\u00e9
site.action.exists = Retourne un 200 vide si l\u2019espace existe, et une erreur (\u00e9ventuellement 404) si ce n\u2019est pas le cas. <br/> Notez que vous pouvez \u00e9galement v\u00e9rifier cela en utilisant simplement la vue d\u2019affichage d\u2019un espace mais qui renvoie \u00e9galement les informations de l\u2019espace afin que cela soit plus rapide
site.field.owner = Un identifiant d\u2019utilisateur, peut \u00eatre modifi\u00e9 apr\u00e8s la cr\u00e9ation d\u2019un espace mais n\u2019a pas d\u2019effet r\u00e9el si les informations de contact sont d\u00e9finies
site.action.group = Permet d\u2019acc\u00e9der \u00e0 des informations de groupe directement en utilisant une url comme \: /site/siteId/group/groupId Pour les actions d\u2019adh\u00e9sion utilisez le fournisseur d\u2019adh\u00e9sion<br /> (GET) /direct/site/siteid/group/groupid - r\u00e9cup\u00e8re des m\u00e9tadonn\u00e9es pour le groupe mais pas l\u2019adh\u00e9sion. <br />(POST) /direct/site/siteid/group/groupid - met \u00e0 jour les m\u00e9tadonn\u00e9es du groupe mais pas l\u2019adh\u00e9sion. <br />(PUT) /direct/site/siteid/group - cr\u00e9e un nouveau groupe dans l\u2019espace (retourne l\u2019id du groupe). Les param\u00e8tres incluent le titre, la description, la liste initiale optionnellement des membres. <br />(DELETE) /direct/site/siteid/group/groupid - supprime un groupe existant dans l\u2019espace.
site.action.groups = Permet d\u2019acc\u00e9der aux groupes pour un espace en utilisant une url comme \: /site/siteId/groupes. <br/> (GET) /direct/site/siteid/groups - obtient des m\u00e9tadonn\u00e9es pour les groupes mais pas l\u2019adh\u00e9sion.
site.action.userPerms = Permet la r\u00e9cup\u00e9ration des permissions de l\u2019utilisateur actuel dans l\u2019espace sp\u00e9cifi\u00e9 en utilisant une url comme /site/\:SITEID\:/userPerms[/\:PREFIX], o\u00f9 PREFIX permet \u00e0 l\u2019appelant de limiter les autorisations retourn\u00e9es \u00e0 un sous-ensemble. Par exemple, l\u2019URL \u2019/direct/site/XYZ/userPerms/calendar.json\u2019 retournera les permissions du calendrier de l\u2019utilisateur courant dans l\u2019espace \u2019XYZ\u2019. Absence de la d\u00e9sactivation de PREFIX entra\u00eenerait la restitution des permissions de tous les outils d\u2019un espace.
site.action.perms = Permet la r\u00e9cup\u00e9ration des permissions pour l\u2019espace sp\u00e9cifi\u00e9 en utilisant une URL comme /site/\:SITEID\:/perms[/\:PREFIX]. , o\u00f9 PREFIX permet \u00e0 l\u2019appelant de limiter les permissions retourn\u00e9es \u00e0 un sous-ensemble. Par exemple, l\u2019URL \u2019/direct/site/XYZ/perms/calendar.json\u2019 renvoie les permissions du calendrier pour chaque r\u00f4le dans l\u2019espace \u2019XYZ\u2019. Absence de la d\u00e9sactivation de PREFIX entra\u00eenerait la restitution des permissions de tous les outils dun espace.
site.action.setPerms = Permet de d\u00e9finir les permissions pour l\u2019espace sp\u00e9cifi\u00e9 en publiant sur l\u2019URL /site/\:SITEID\:/setPerms. Cela se fait en passant un ensemble de param\u00e8tres de publication o\u00f9 la cl\u00e9 prend la forme de \u2019ROLEID\:FUNCTION\u2019 et la valeur est un bool\u00e9en \u2019true\u2019 ou \u2019false\u2019. Par exemple, passer le param\u00e8tre \u2019maintain\:blog.post.create\=true\u2019 basculera la fonction blog.post.create pour le r\u00f4le de maintien dans l\u2019espace sp\u00e9cifi\u00e9.
site.action.pages = Permet la r\u00e9cup\u00e9ration de toutes les pages et tous les outils d\u2019un espace, utiliser les propri\u00e9tes (true/false, false par d\u00e9faut) pour inclure les propri\u00e9t\u00e9s de la page, utilisez config (true/false, default false) pour inclure les configurations de l\u2019outil
site.action.withPerm=L\u2019URL par exemple, /site/withPerm/.json?permission\=site.upd
