wiki_about_course_page=h2 \u00c0 propos de ce cours\n\
\n\
Quelques informations \u00e0 propos de ce cours\n\
\n\


wiki_about_project_page=h2 A propos de ce projet\n\
\n\
Quelques informations \u00e0 propos de ce projet\n\
\n\

wiki_default_page_template=h2 Nouvelle page \n\
\n\
Ceci est une nouvelle page. Pour ajouter du texte \u00e0 celui-ci \:\n\
* Cliquez sur le bouton 'modifier' dans la barre d'actions ci-dessus.\n\
* Vous verrez le texte sur cette page appara\u00eetre dans une zone de texte modifiable.\n\
* Supprime ce texte 'de d\u00e9marrage' et tapez le texte que vous souhaitez \u00e0 la place. Pour formater le texte, utilisez les ic\u00f4nes du bouton de mise en forme, qui ins\u00e9reront les codes de mise en forme wiki appropri\u00e9s.\n\
* Cliquez sur le bouton 'Enregistrer'.\n\

wiki_edit_right=h1 Wiki Astuces\n\
__Pour cr\u00e9er une nouvelle page__\n\
\n\
Tapez le nom de la nouvelle page que vous voulez cr\u00e9er entre crochets\:\n\
\n\
* \\[ma nouvelle page\\] \n\
__Pour formater votre texte__\n\
\n\
S\u00e9lectionnez le texte \u00e0 formater et utilisez les boutons de formatage pour ins\u00e9rer automatiquement les codes de formatage du wiki.\n\
\n\
__Puces et num\u00e9rotation __\n\
\n\
Pour les listes \u00e0 puces, mettre un * (\u00e9toile) devant chaque \u00e9l\u00e9ment de la liste \: \n\
\n\
\\* point 1\n\
\n\
\\* point 2\n\
\n\
* point 1\n\
\n\
* point 2\n\
\n\
Pour les listes num\u00e9rot\u00e9es, mettre un \# (hash) devant chaque \u00e9l\u00e9ment de la liste.\n\
\n\
[Plus de conseils sur le formatage du wiki|Page d'aide]


wiki_help_page=h1 How to format your Wiki pages\n\
Wiki pages may be formatted using codes given below. These codes provide simple text styles such as __bold__, ~~italic~~ and lists.\n\
\n\
There are also a number of 'macros' which can automatically provide certain information, as well as being used for more complex tasks, such as including tables, images and attachments.\n\
\n\
h1 Formatting short-cut icons\n\
You can insert common formatting commands using the links in the toolbar at the top of the wiki page editor. These links include bold, italic, headings, tables, uploading attachments and including images.\n\
\n\
h3 Simple text formatting\n\
\n\
{table}\n\
Type these codes| Displays as | Descriptions\n\
\\_\\_bold\\_\\_ | __bold__ | simple bold text\n\
\\~\\~italics\\~\\~ | ~~italics~~ | simple italic text\n\
\\-\\-strike\\-\\- | --strike-- | strike through text\n\
\\\#\\\#monospace\\\#\\\# | --monospace-- | monospaced text, useful for code examples\n\
CH\\%\\%4\\%\\%|CH%%4%%| subscript (for more mathematical formatting, see below)\n\
Ca\\^\\^2+\\^\\^| Ca^^2+^^| superscript \n\
\\[my new page\\] | [my new page] | links to a new Wiki page with the name given in brackets\n\
\\http\://www.bbc.co.uk/ | http\://www.bbc.co.uk/ | creates an automatic link to an external website or an online document. \n\
h1 Title || a major headline (displayed as <H1> would be in the local CSS styling)\n\
h3 Title || a minor headline (displayed as <H3> would be in the local CSS styling)\n\
\\{bgcolor\:yellow\\}Some text\\{bgcolor\\}|{bgcolor\:yellow}Highlighted text{bgcolor}|Highlights the text between the brackets (note US spelling\!)\n\
\\{color\:red\\}Some text\\{color\\}|{color\:red}Red text {color}|Changes the colour of the text between the brackets (note US spelling\!)\n\
\\-\\-\\-\\- || display a horizontal line across the page\n\
- list item|| create a bulleted list \n\
* list item|| create a bulleted list which displays slightly differently to the one above\n\
a. list item|| create an automatically alphabetical list\n\
A. list item|| uppercase alphabetical list\n\
i. list item|| lowercase Roman numerical list\n\
I. list item|| uppercase Roman numerical list\n\
g., h., k., j. list item|| Greek, Hiragana, Katakana & Hebrew numerical lists\n\
(empty line) || divides text into paragraphs\n\
\\\\\\ || creates extra space between paragraphs\n\
\\\\\\\\X | X | display the special character "X" (for example, \\\\\\\\{ will display {)\n\
\\\\\\\\\\\\\\\\\\ | \\\\\\\\ | display a \\\\\\\\ \n\
{table} \n\
\n\
h3 Macros and More \n\
For a full list of macros and parameters, type \\{list-of-macros\\} in any page. This list gives an introduction to the most useful.\n\
\n\
__Add an email link__\n\
\n\
{mailto\:} followed by an email address will create an email link in the page.\n\
\n\
e.g. \\{mailto\:pbehr@cam.ac.uk\\} will display as {mailto\:pbehr@cam.ac.uk}\n\
\n\
__Create an automatic index for your Wiki__\t\n\
\n\
Typing \\{index\\} will create an automatically updated index of pages for your Wiki. \n\
\n\
(No example as it takes up a lot of space\!)\n\
\n\
__Create an automatic list of recently changed pages__\n\
\n\
Typing \\{recent-changes\\} will create an automatically updated list of the recently changed pages in your Wiki, together with the name of the person who last changed the page and the date and time of the change. By default, it shows all the pages changed in the last 30 days.\n\
\n\
*  \\{recent-changes\:12h\\} - recently changed pages in the last 12 hours.\n\
*  \\{recent-changes\:7d\\} - recently changed pages in the last 7 days.\n\
*  \\{recent-changes\:2\u006-12-25\\} - recently changed pages since 25 Dec, 2\u006.\n\
\n\
(No example as it takes up a lot of space\!)\n\
\n\
\n\
__Add an image to your page__\n\
\n\
Typing \\{image\:\\} and including the URL of the image will display a image in your page. (This is just the same as clicking the image icon in the edit screen, which is easier to use.)\n\
\n\
\\{image\:/images/bear.jpg|A Bear\\} would show the image whose relative URL was "/images/bear.jpg". The alternative text shown would be "A Bear".\n\
\n\
To float your image left, so that text flows round it, include the extra text "|ext|float-left", as below\:\n\
\n\
\\{image\:/images/bear.jpg|A Bear|ext|float-left\\} \n\
\n\
To float your image right, so that text flows round it, include the extra text "|ext|float-right", as below\:\n\
\n\
\\{image\:/images/bear.jpg|A Bear|ext|float-right\\} \n\
\n\
\n\
The image URL may be relative or absolute but cannot be external. The URL may also start with "worksite\:/" to display images from this worksite. To display images from your other worksites, you may start a URL with "sakai\:/" and include the site ID.\n\
\n\
__Create an anchor tag__\n\
\n\
Typing \\{anchor\\} creates an HTML anchor tag around the text it contains.\t\n\
\n\
e.g. \\{anchor\:myLink\\}Jump to this point \\{anchor\\}\n\
\n\
The link to jump to that point should appear as follows\:\n\
\n\
\\[Go to this exciting point|Name of current page here\#myLink\\]\n\
\n\
__Using mathematical formatting__\n\
\n\
RWiki uses JS Math so that you can display maths entered in TeX form. \n\
\n\
Typing \\{math\:display\\} \\{math\\} will display TeX between the two tags.\t\n\
\n\
e.g. \\{math\:display\\}U_n+2\\} U_n+1\\} U_n \\{math\\} \n\
{math\:display}U_n+2} U_n+1} U_n {math} \n\
\n\
Find out more {link\:here|http\://www.math.union.edu/~dpvc/jsMath/welcome.html|none|_new}\n\
\n\
__Display a quotation__\n\
\n\
To display a quotation, type \\{quote\\} on either side of the text you want to display as a quote.\n\
\n\
{quote}Like this\!{quote}\n\
\n\
\n\
\n\
h3 Sakai related macros\n\
\n\
__\\{sakai-sections\\}__\tGenerate a list of links that point to subsites that are automatically generated for each section in your worksite. Note that there is no interface within the wiki to manage permissions on a section by section level.\n\
\n\
__\\{worksiteinfo\\}__ Lists the information about the current site\t\n\


wiki_home_page=h1 Bienvenue dans l'outil Wiki\n\
\n\
\n\
\n\
h3 Qu'est-ce qu'un wiki ?\n\
\n\
\n\
\n\
Un wiki est un outil qui permet aux personnes de cr\u00e9er des pages web seules ou en groupe sans avoir besoin de comp\u00e9tences web.\n\
\n\
\n\
\n\
Lorsque vous utilisez l'outil wiki, vous pouvez cr\u00e9er et modifier des pages web dans votre espace de travail. Si vous le souhaitez, vous pouvez rendre publiques toutes ou certaines de ces pages.\n\
\n\
\n\
\n\
h3 De l'usage p\u00e9dagogique des wikis\n\
\n\
Il existe un grand nombre de mani\u00e8re de faire un usage p\u00e9dagogique des wikis - une recherche web trouvera des nombreuses suggestions et \u00e9tudes de cas. Par exemple, les \u00e9tudiants peuvent d\u00e9velopper un ensemble de ressources concernant un sujet qu'ils \u00e9tudient et les rendre disponibles \u00e0 l'ext\u00e9rieur. D'autres intervenants aiment produire une pages wiki comme moyen de publier des notes et des conseils de cours pour que les \u00e9tudiants puissent les lire mais pas les modifier.\n\
\n\
\n\
\n\
h3 De l'usage des wikis pour le groupes de recherche\n\
\n\
Un wiki permet \u00e0 des personnes de travailler ensemble \u00e0 la production d'un document, que ce soit un brouillon de proposition de recherche cr\u00e9\u00e9 en \u00e9quipe ou pour garder une liste \u00e0 jour des contacts pour un projet.\n\
\n\
\n\
\n\
h3 Comment commencer ?\n\
\n\
Ceci est la page d'accueil de votre wiki. Pour y ajouter du texte \:\n\
\n\
* Cliquez sur le bouton «\u00a0Modifier\u00a0» de la barre d'actions ci-dessus.\n\
\n\
* Vous verrez le texte de cette page appara\u00eetre dans formulaire de saisie de texte.\n\
\n\
* Supprimez ce texte de d\u00e9part et tapez le texte que vois d\u00e9sirez voir appara\u00eetre \u00e0 sa place. Pour formater le texte, utilisez les boutons avec des ic\u00f4nes qui ins\u00e9reront les codes de formatage appropri\u00e9s.\n\
\n\
* Cliquez sur le bouton «\u00a0Enregistrer\u00a0».\n\

wiki_recent_changes=h1 Modifications r\u00e9centes\n\
{recent-changes}\n\











