################################
#    READ ME!!
################################
#
#  For people creating new pages, make sure you add the page settings in Tutorial.properties:
#  
#  		You can create new pages simply by adding a new set of properties.  For instance, to add a page, define a set of properties like:
#
#  		{prefix}.title=(title)
#  		{prefix}.body=(body) 
#

#Button Navigation text:
next=Suivant
previous=Pr\u00e9c\u00e9dent

#End Tutorial text:
endTutorial=Ok, c&\#39;est compris\!



#Welcome panel
introToSakai_p1.title=Bienvenue
introToSakai_p1.body=Ce tr\u00e8s court tutoriel vous pr\u00e9sente les bases des fonctionnalit\u00e9s et de la mise en page de Sakai. Il est pr\u00e9sent\u00e9 lors de votre premi\u00e8re connexion. Vous pourrez y acc\u00e9der \u00e0 nouveau en choisissant &\#39;Tutoriel&\#39; dans le menu en haut \u00e0 droite \u00e0 c\u00f4t\u00e9 du bouton de d\u00e9connexion. Des informations d\u00e9taill\u00e9es \u00e0 propos de chaque fonctionnalit\u00e9 peuvent \u00eatre obtenues en cliquant sur le bouton d&\#39;aide <img src\=\u2019/library/image/silk/help.png\u2019/> que vous trouverez partout dans Sakai.<br/><br/> Sakai est une plate-forme tr\u00e8s flexible pour organiser des espaces correspondant \u00e0 des enseignements ou \u00e0 des projets. Les espaces poss\u00e8dent des outils et des fonctionnalit\u00e9s sp\u00e9cifiques qui sont choisis par leurs responsables.<br/><br/> Cliquez ci-dessous sur \u2019Suivant\u2019 pour avancer dans cette courte pr\u00e9sentation de Sakai.

#Site Navigation panel
introToSakai_sitenav.title=Navigation dans les espaces
introToSakai_sitenav.body=Tous les espaces auxquels vous \u00eates inscrit apparaissent sous forme d\u2019onglets en commen\u00e7ant par &\#39;Mon espace de travail&\#39;  <span class\=no-wrap>( <i class\=fa fa-home tut-icon-home></i> ) </span>sur la gauche, un espace sp\u00e9cial qui est votre espace priv\u00e9. Chaque fois que vous vous connectez, vous d\u00e9marrerez sur la page d\u2019accueil de votre &\#39;Mon espace de travai&\#39;.\n<br/><br/>\n&\#39;Mon espace de travail&\#39; contient g\u00e9n\u00e9ralement plusieurs outils pr\u00e9sent\u00e9s sous forme de blocs sur sa page d\u2019accueil qui r\u00e9sument l&\#39;activit\u00e9 dans tous les espaces dont vous \u00eates membre.\n<br/><br/>\nSi vous \u00eates membre d\u2019autres espaces (cours, projet, etc.), leurs onglets seront \u00e9galement affich\u00e9s horizontalement en haut. Vous pouvez contr\u00f4ler le nombre d\u2019onglets affich\u00e9s. S\u2019il y a de nombreux espaces, certains pourront \u00eatre pr\u00e9sents dans un menu d\u00e9roulant sous &\#39;Plus d&\#39;espaces&\#39;.\n<br/><br/>\nVous pouvez \u00e9galement cliquer sur un onglet pour acc\u00e9der directement \u00e0 la page d\u2019accueil de cet espace. En cliquant sur la fl\u00e8che &\#39;bas&\#39; dans l\u2019onglet, vous pouvez acc\u00e9der directement \u00e0 certains des outils de cet espace par l&\#39;interm\u00e9diaire d&\#39;une liste.\n<br/><br/>\nCliquez sur &\#39;Suivant&\#39; pour continuer.

#Current Site panel (narrow view only)
introToSakai_currentSite.title=L&\#39;espace actuel
introToSakai_currentSite.body=Le titre de l&\#39;espace que vous visitez actuellement est affich\u00e9 ici.<br/><br/>Cliquez ou appuyez dessus pour retourner \u00e0 la page principale de cet espace.

#Sites panel (narrow view only)
introToSakai_allsites.title=Espaces
introToSakai_allsites.body=Le bouton <span class\=no-wrap><i class\=fa fa-th tut-icon-sites></i> Espaces</span> ouvre le tiroir de vos espaces, qui affiche des liens vers tous vos espaces visibles organis\u00e9s par terme ou par cat\u00e9gorie.<br/><br/>Depuis Espaces, vous pouvez mettre en favoris vos espaces les plus utilis\u00e9s et acc\u00e9der \u00e0 votre propre espace priv\u00e9 appel\u00e9 Mon espace de travail.

#Sites panel
introToSakai_moreButton.title=Plus d&\#39;espaces
introToSakai_moreButton.body=Cliquez sur <span class\=no-wrap><i class\=fa fa-th tut-icon-sites></i>&\#39;Plus d\u2019espaces&\#39;</span> pour afficher la liste de tous les espaces auxquels vous avez acc\u00e8s.<br/><br/>Cliquez sur Suivant pour continuer.

#Site Fav panel
introToSakai_favSites.title=Espaces favoris
introToSakai_favSites.body=Les espaces favoris sont \u00e9pingl\u00e9s sur la navigation sup\u00e9rieure pour un acc\u00e8s facile.<br /><br />Vous pouvez \u00e9pingler ou d\u00e9s\u00e9pingler un espace en haut en cliquant ou en appuyant sur l\u2019\u00e9toile <span class\=no-wrap>( <i class\=fa fa-star tut-icon-star></i> )</span> \u00e0 c\u00f4t\u00e9 titre de l&\#39;espace. 

#Tool Menu panel
introToSakai_toolMenu.title=Menu des outils
introToSakai_toolMenu.body=Dans l&\#39;espace dans lequel vous vous trouvez, le menu de gauche pr\u00e9sente la liste des outils disponibles. Accueil est habituellement le premier. En cliquant dessus, vous afficherez la page d\u2019accueil. Chaque outil sert \u00e0 une fonction diff\u00e9rente. Une courte description s&\#39;affichera au survol de son nom avec le pointeur.\n<br/><br/><br/>\nSi vous \u00eates le propri\u00e9taire d\u2019un espace ou que celui-ci a partag\u00e9 ces droits avec vous, Informations de l&\#39;espace vous permet d\u2019ajouter ou supprimer des outils au menu ou de changer leur ordre dans le menu.\n<br/><br/><br/>\nCliquez sur Suivant pour continuer.

#Tool Menu panel (for narrow view)
introToSakai_toolMenuNarrowView.title=Menu Outils
introToSakai_toolMenuNarrowView.body=Les outils pour l&\#39;espace actuel apparaissent dans le menu Outils. Chaque outil sert une fonction diff\u00e9rente, comme la fourniture de contenu, la fourniture d&\#39;\u00e9valuations ou la facilitation de la collaboration.<br/><br/>Chaque responsable &\#39;\u2019espace, comme l&\#39;instructeur, contr\u00f4le quels outils apparaissent dans l&\#39;espace et comment ils apparaissent.

#Refresh Tool panel (for desktop view)
introToSakai_refreshTool.title=Nom de l\u2019outil
introToSakai_refreshTool.body=Le nom de l&\#39;outil en haut de la page indique quel outil vous utilisez.<br /><br />Cliquez ou tapotez-le pour retourner \u00e0 la page principale de cet outil.

#Refresh Tool panel (for narrow view)
introToSakai_refreshToolNarrowView.title=Nom de l&\#39;outil
introToSakai_refreshToolNarrowView.body=Le nom de l&\#39;outil en haut de la page indique quel outil vous utilisez.<br /><br />Cliquez ou tapotez-le pour retourner \u00e0 la page principale de cet outil.

#Help Icon panel
introToSakai_helpIcon.title=Bouton Aide
introToSakai_helpIcon.body=Une aide est disponible pour chaque fonctionnalit\u00e9 en cliquant sur l&\#39;ic\u00f4ne <img src\=/library/image/silk/help.png/>. L&\#39;information fournie est sensible au contexte et correspondra \u00e0 l&\#39;outil dans lequel vous l&\#39;avez appel\u00e9e. Vous pouvez \u00e9galement acc\u00e9der \u00e0 l\u2019ensemble de l&\#39;aide.\n<br/><br/>\nCliquez sur Suivant pour continuer.

#Account Menu panel
#formerly the Profile Tool panel
introToSakai_profileTool.title=Outil Profil
introToSakai_profileTool.body=L&\#39;outil Profil est accessible ici et dans le menu de gauche de &\#39;Mon Espace de travail&\#39;. Il vous permet d\u2019enregistrer des informations personnelles, d&\#39;en contr\u00f4ler l&\#39;acc\u00e8s, de vous mettre en relation avec d&\#39;autres personnes inscrites dans cette installation Sakai et de construire votre r\u00e9seau de relations. <br/><br/>Cliquez sur Suivant pour continuer.

#Return to Tutorial panel
introToSakai_pTutorialLocation.title=Tutoriel
introToSakai_pTutorialLocation.body=Vous pouvez retourner \u00e0 ce tutoriel en cliquant sur le lien appropri\u00e9 dans le menu d\u00e9roulant. 
