no_submission_for=Aucune soumission pour
grading_rubric_tooltip=Noter cette soumission en utilisant une grille d\u2019\u00e9valuation
rubric=Grille d\u2019\u00e9valuation
add_feedback_tooltip=\u00c9crivez ou enregistrez des commentaires pour cet \u00e9tudiant
written_feedback_label=\u00c9crire un commentaire
recorded_feedback_label=Enregistrer un commentaire
add_attachments_tooltip=Ajouter des pi\u00e8ces jointes \u00e0 votre notation
private_notes_tooltip=Ajoutez des notes, pour vous-m\u00eame et pour d\u2019autres instructeurs. Les \u00e9tudiants ne seront *PAS* en mesure de les voir.
settings=Configuration
only_ungraded=Afficher uniquement les envois non not\u00e9s
only_submitted=Afficher uniquement les soumissions actuelles
returned_tooltip=Cette note a \u00e9t\u00e9 retourn\u00e9e \u00e0 l\u2019\u00e9tudiant
grader_on_left=Ancrer le correcteur \u00e0 gauche
confirm_remove_attachment=Ceci supprimera d\u00e9finitivement la pi\u00e8ce jointe du commentaire. Voulez-vous continuer ?
confirm_discard_changes=Vous avez apport\u00e9 des modifications. Voulez-vous les supprimer ?
saved_successfully=La note a \u00e9t\u00e9 enregistr\u00e9e avec succ\u00e8s.
feedback_attachment_tooltip=Cliquez pour t\u00e9l\u00e9charger cette pi\u00e8ce jointe de commentaire.
student_selector_label=S\u00e9lecteur d\u2019\u00e9tudiant
attempt_selector_label=S\u00e9lecteur de nombre de tentatives
lettergrade_selector_label=S\u00e9lecteur de note en lettres
passfail_selector_label=S\u00e9lecteur de note r\u00e9ussite/\u00e9chec
number_grade_label=Champ de saisie de note num\u00e9rique
checkgrade_label=Case de saisie de la note \u00e0 cocher
comment_present=Il y a un commentaire sur cette soumission
notes_present=Il y a des notes priv\u00e9es pour cette soumission
profile_image=image de profil
inline_feedback_instruction=Ceci est le texte soumis, avec vos commentaires. Pour ajouter plus de commentaires, cliquez sur Ajouter un commentaire" au bas de la soumission, puis cliquez sur Termin\u00e9" lorsque vous avez termin\u00e9. <strong>Vos modifications ne seront pas enregistr\u00e9es tant que vous n\u2019aurez pas cliqu\u00e9 sur l\u2019un des boutons de sauvegarde dans le correcteur.</strong>
confirm_exceed_max_grade=La note que vous avez saisie est plus grande que le max de {}. Est-ce correct ?`
unlimited=Illimit\u00e9
